export const SENIOR_ONBOARDING_STEPS = [
  {
    title: '아래 약관을 확인해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '선약을 시작해 볼까요?',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '학교를 선택해주세요',
    description: '졸업하신 학교를 입력해주세요',
  },
  {
    title: '전공 계열을 알려주세요',
    description: '자신의 주 전공과 맞는 계열을 골라주세요.',
  },
  {
    title: '학과를 선택해주세요',
    description: '주전공과 부전공을 선택해주세요 ! ( 최대 3개 )',
  },
  {
    title: '졸업 사실을 인증해주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '재직 사실을 인증해주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '회사 재직 기간을 알려 주세요',
    description: '선배님의 직무와 연차를 선택해주세요',
  },
  {
    title: '직무를 알려 주세요',
    description: '선배님의 직무와 연차를 선택해주세요',
  },
  {
    title: '휴대전화 번호를 입력해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
];

export const JUNIOR_ONBOARDING_STEPS = [
  {
    title: '아래 약관을 확인해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '선약을 시작해 볼까요?',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '휴대전화 번호를 입력해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '학교를 선택해주세요',
    description: '재학중이신 학교를 입력해주세요',
  },
  {
    title: '학교 메일을 입력해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '전공 계열을 알려주세요',
    description: '자신의 주 전공과 맞는 계열을 골라주세요.',
  },
  {
    title: '학과를 선택해주세요',
    description: '주전공과 부전공을 선택해주세요 ! ( 최대 3개 )',
  },
];

export const 계열_LIST = ['공학계열', '교육계열', '사회계열', '자연계열', '인문계열', '의약계열', '예체능계열'];
export const 약관_LIST = [
  '(필수) 개인정보 수집 및 이용 동의',
  '(필수) 만 14세 이상',
  '(필수) 하나 추가',
  '(선택) 서비스 혜택 정보 수신',
];

export const ONBOARDING_HEADER = ['약관 동의', '개인정보 입력', '학교 인증', '재직 인증'];

export const 세부직무_LIST = [
  '경영 ・ 비지니스',
  '서비스 기획 ・ 운영',
  '개발',
  '데이터 ・ AI ・ ML',
  '마케팅 ・ 광고 ・ 홍보',
  '디자인',
  '미디어 ・ 커뮤니케이션',
  '이커머스 ・ 리테일',
  '금융 ・ 컨성팅 ・ VC',
  '회계 ・ 재무',
  '인사 ・ 채용 ・ 노무',
  '고객 ・ 영업',
  '게임 기획 ・ 개발',
  '물류 ・ 구매',
  '의료 ・ 제약 ・ 바이오',
  '연구 ・ R&B',
  '엔지니어링 ・ 설계',
  '생산 ・ 품질',
  '교육',
  '법률 ・ 특허',
  '공공 ・ 복지 ・ 환경',
];

export const 세부직무_DESCRIPTION = `후배들이 선배님의 직무를 통해 탐색할 때 활용돼요\n명함에 적혀있는 직무와 완전히 동일한 이름이 아니어도 돼요`;
