export const STEP_TITLE = [
  {
    title: '아래 약관을 확인해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '선약을 시작해 볼까요?',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '학교를 선택해주세요',
    description: '졸업하신 학교를 입력해주세요',
  },
  {
    title: '전공 계열을 알려주세요',
    description: '자신의 주 전공과 맞는 계열을 골라주세요.',
  },
  {
    title: '학과를 선택해주세요',
    description: '주전공과 부전공을 선택해주세요 ! ( 최대 3개 )',
  },
  {
    title: '졸업 사실을 인증해주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '재직 사실을 인증해주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
  {
    title: '회사 재직 기간을 알려 주세요',
    description: '선배님의 직무와 연차를 선택해주세요',
  },
  {
    title: '직무를 알려 주세요',
    description: '선배님의 직무와 연차를 선택해주세요',
  },
  {
    title: '직무를 알려 주세요',
    description: '선배님의 직무와 연차를 선택해주세요',
  },
  {
    title: '휴대전화 번호를 입력해 주세요',
    description: '개인정보는 안전하게 보관되어 누구에게도 공개되지 않아요.',
  },
];
