import { dayType } from '@pages/seniorProfile/types';

export const SENIOR_PROFILE_STEPS = [
  {
    meta: '',
    description: '',
  },
  {
    meta: `다른 선배들은 프로필을\n이렇게 등록했어요`,
    description: ``,
  },
  {
    meta: ` 님을 표현할 수 있는 문장을\n작성해주세요`,
    description: ``,
  },
  {
    meta: ` 님의 경력과 수상이력을\n작성해주세요`,
    description: `수상 이력은 검증 후 프로필에 표시됩니다`,
  },
  {
    meta: ` 님이 후배에게 들려주고 싶은\n이야기를 작성해주세요`,
    description: ``,
  },
  {
    meta: `약속이 가능한 일정을\n모두 입력해주세요`,
    description: `주중/주말로 구분하여 시간을 설정하거나\n요일 별로 각각 시간을 설정할 수 있어요`,
  },
  {
    meta: `마지막으로 완성된\n프로필을 확인해주세요`,
    description: ``,
  },
  {
    meta: `고생하셨어요!\n프로필 등록이 완료되었어요`,
    description: `프로필은 마이페이지에서 수정할 수 있어요`,
  },
];

export const WEEKENDS: dayType[] = ['월', '화', '수', '목', '금', '토', '일'];

export const HOUR_TIME = [
  '06:00',
  '07:00',
  '08:00',
  '09:00',
  '10:00',
  '11:00',
  '12:00',
  '13:00',
  '14:00',
  '15:00',
  '16:00',
  '17:00',
  '18:00',
  '19:00',
  '20:00',
  '21:00',
  '22:00',
  '23:00',
  '24:00',
];

export const TIME_LIST = [
  '06:00',
  '06:30',
  '07:00',
  '07:30',
  '08:00',
  '08:30',
  '09:00',
  '09:30',
  '10:00',
  '10:30',
  '11:00',
  '11:30',
  '12:00',
  '12:30',
  '13:00',
  '13:30',
  '14:00',
  '14:30',
  '15:00',
  '15:30',
  '16:00',
  '16:30',
  '17:00',
  '17:30',
  '18:00',
  '18:30',
  '19:00',
  '19:30',
  '20:00',
  '20:30',
  '21:00',
  '21:30',
  '22:00',
  '22:30',
  '23:00',
  '23:30',
  '24:00',
];
